papers/privacy/presentations/L10_11_knowledge/knowledge.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-16 Di 17:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>(Common) Knowledge</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christoph Schottmueller" />
</head>
<body>
<div id="preamble" class="status">
<div id="preamble" class="status">
  <div class="banner">

    <p style="text-align: justify;">
      
  <a id="subtitle" href="https://schottmueller.github.io/index.html">Home</a>
  <a id="subtitle" href="https://schottmueller.github.io/research.html">Research</a>
  <a id="subtitle" href="https://schottmueller.github.io/teaching.html">Teaching</a>
  <a id="subtitle" href="https://schottmueller.github.io/misc.html">Misc</a>

  <span> </span>
</div>

</p>

</div>
</div>
</div>
<div id="content">
<h1 class="title">(Common) Knowledge</h1>
<p>
Let us assume that the state space is finite. Using the knowledge operator iteratively, we can then quickly find all states in which an event E is common knowledge: We first ask: in which states does player 1 know E? These are the states K<sub>1</sub>(E). In other states, E can obviously not be common knowledge. So we consentrate on K(E). If E was common knowledge in K(E), then player 2 has to know K<sub>1</sub>(E) in every state of K<sub>1</sub>(E). Hence, let's check K<sub>2</sub>(K<sub>1</sub>(E)). If K<sub>2</sub>(K<sub>1</sub>(E))=K<sub>1</sub>(E) (and assuming we have only two players), then E is common knowledge in every state in K<sub>1</sub>(E) and we are done. Otherwise, we can concentrate on states in K<sub>2</sub>(K<sub>1</sub>(E)): After all player 1 has to know E and player 2 has to know that player 1 knows E if E is common knowledge.
</p>

<p>
Now we are back at player 1: If E is common knowledge in K<sub>2</sub>(K<sub>1</sub>(E)), then player 1 has to know K<sub>2</sub>(K<sub>1</sub>(E)) whenever the state is in K<sub>2</sub>(K<sub>1</sub>(E)). Hence, we check whether K<sub>1</sub>(K<sub>2</sub>(K<sub>1</sub>(E)))=K<sub>2</sub>(K<sub>1</sub>(E))&#x2026;
</p>

<p>
We continue with this procedure until either we have found some set W = K<sub>i</sub>(&#x2026;K<sub>2</sub>(K<sub>1</sub>(E))) such that W= K<sub>1</sub>(W)=K<sub>2</sub>(W) or until K<sub>i</sub>(&#x2026;K<sub>2</sub>(K<sub>1</sub>(E)))={}. In the latter case, E is not common knowledge in any state.
The code below does exactly this using the example from the lecture.
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">infostructure</span>:

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900; font-weight: bold;">self</span>,partitions):
        <span style="color: #2aa198;">"""read in partitions </span>
<span style="color: #2aa198;">        'partitions' is a list where each element is the info partition of one player</span>
<span style="color: #2aa198;">        an info partition is a list of sets where each set is one element of the partition"""</span>
        <span style="color: #859900; font-weight: bold;">self</span>.parts = partitions
        <span style="color: #859900; font-weight: bold;">self</span>.n = <span style="color: #839496; font-weight: bold;">len</span>(<span style="color: #859900; font-weight: bold;">self</span>.parts)<span style="color: #586e75;">#</span><span style="color: #586e75;">number of players</span>

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">know</span>(<span style="color: #859900; font-weight: bold;">self</span>,event,i):
        <span style="color: #2aa198;">"returns the set of states in which player i knows event"</span>
        <span style="color: #268bd2;">out</span> = <span style="color: #839496; font-weight: bold;">set</span>()
        <span style="color: #268bd2;">info_i</span> = <span style="color: #859900; font-weight: bold;">self</span>.parts[i]
        <span style="color: #859900; font-weight: bold;">for</span> part <span style="color: #859900; font-weight: bold;">in</span> info_i:
            <span style="color: #859900; font-weight: bold;">if</span> part.issubset(event):
                <span style="color: #268bd2;">out</span> = out.union(part)
        <span style="color: #859900; font-weight: bold;">return</span> out

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">common_know</span>(<span style="color: #859900; font-weight: bold;">self</span>,event):
        <span style="color: #2aa198;">"returns the states in which event is common knowledge"</span>
        <span style="color: #268bd2;">candidate</span> = event
        <span style="color: #268bd2;">old_candidate</span> = <span style="color: #839496; font-weight: bold;">set</span>()
        <span style="color: #859900; font-weight: bold;">while</span> old_candidate!=candidate <span style="color: #859900; font-weight: bold;">and</span> <span style="color: #839496; font-weight: bold;">len</span>(candidate)&gt;0:
            <span style="color: #268bd2;">old_candidate</span> = candidate
            <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">range</span>(<span style="color: #859900; font-weight: bold;">self</span>.n):
                <span style="color: #268bd2;">candidate</span> = <span style="color: #859900; font-weight: bold;">self</span>.know(candidate,i)
        <span style="color: #859900; font-weight: bold;">return</span> candidate

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">common_know_in_w</span>(<span style="color: #859900; font-weight: bold;">self</span>,event,w):
        <span style="color: #2aa198;">"checks whether event is common knowledge in state w; returns True/False"</span>
        <span style="color: #859900; font-weight: bold;">if</span> w <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #859900; font-weight: bold;">self</span>.common_know(event):
            <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">True</span>
        <span style="color: #859900; font-weight: bold;">else</span>:
            <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">False</span>

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">self_evident</span>(<span style="color: #859900; font-weight: bold;">self</span>,event,players):
        <span style="color: #2aa198;">"checks whether event is self evident among players in list 'players' "</span>
        <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> players:
            <span style="color: #859900; font-weight: bold;">for</span> part <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #859900; font-weight: bold;">self</span>.parts[i]:
                <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #839496; font-weight: bold;">len</span>(event.intersection(part))&gt;0 <span style="color: #859900; font-weight: bold;">and</span> <span style="color: #859900; font-weight: bold;">not</span> part.issubset(event):
                    <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">False</span>
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">True</span>


<span style="color: #268bd2;">partition1</span> = [{1,2},{3,4,5},{6}]
<span style="color: #268bd2;">partition2</span> = [{1},{2,3,4},{5},{6}]
<span style="color: #268bd2;">ex1</span> = infostructure([partition1,partition2])



<span style="color: #268bd2;">F</span> = {1,2,3,4,5}
<span style="color: #268bd2;">E</span> = {1,2,3,4}
<span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">'F is common knowledge in states '</span>,<span style="color: #839496; font-weight: bold;">list</span>(ex1.common_know(F)), <span style="color: #2aa198;">'.  E is common knowledge in states '</span>, <span style="color: #839496; font-weight: bold;">list</span>(ex1.common_know(E)),<span style="color: #2aa198;">'.'</span>

</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">F is common knowledge in states</td>
<td class="org-left">(1 2 3 4 5)</td>
<td class="org-left">.  E is common knowledge in states</td>
<td class="org-left">nil</td>
<td class="org-left">.</td>
</tr>
</tbody>
</table>
</div>
</body>
</html>
